{
  "main": {
    "name": "Hi, I'm Sebastián Díaz",
    "description": " A Full Stack Software Developer from Chile, currently based in Dublin, Ireland. I specialize mainly in Typescript/Javascript development",
    "image": "profilepic.jpeg",
    "bio": "As a experienced Software Developer with over four years of experience. I have expertise in backend technologies such as Node.js, Nest.js, MariaDB, Express.js, and MongoDB. On the front-end, I am proficient in React.js and Vue.js, along with HTML & CSS. My journey began in Chile, but I've had the opportunity to live in Ireland. I can communicate comfortably In Spanish or English, allowing me to work effectively in multicultural teams. I have a proven track record of developing robust, secure, and responsive web applications. I am accurate at translating client requirements into functional software.",
    "contactmessage": "Please fill your contact information here",
    "email": "sebastian.diaz.dev98@gmail.com",
    "phone": "+353 874292870",
    "github": "https://github.com/DevSebas-Code/sebastian-portfolio",
    "project": "https://github.com/DevSebas-Code/sebastian-portfolio",
    "address": {
      "street": "I'm currently in Ireland",
      "city": "Dublin, D15"
    },
    "website": "",
    "resumedownload": "https://drive.google.com/file/d/1CEG_S9A5t6RHPPhwVBUapGAOGLHOjI9k/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/sebasti%C3%A1n-d%C3%ADaz-7b002520b/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/DevSebas-Code/sebastian-portfolio",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Self-taught",
        "degree": "Javascript/Typescript",
        "description": "Front-End Development: Skilled in creating engaging user interfaces using HTML5, CSS3, and JavaScript frameworks like React or Vue.js. Emphasis on responsive design and cross-browser compatibility. Back-End Development: Experienced in building server-side logic using Node.js, Express.js, or similar frameworks. Proficient in handling HTTP requests, implementing APIs, and working with databases like MongoDB or MySQL. Expertise in data modeling, authentication, security, and scalability."
      },
      {
        "school": "Duoc UC College",
        "degree": "Computer Programming Analyst",
        "graduated": "2017 - 2020",
        "description": "Fundamentals and Good Practices of Software Development, Analysis and Planning of IT Requirements, Analysis and Development of Data Structures and Database Data Modeling. "
      }
    ],
    "work": [
      {
        "company": "Reactable AI",
        "title": "Software Enginner, Backend Tech-Lead - Dublin, Ireland",
        "years": "2024 - Present",
        "description": "At Reactable, an AI-powered platform for effortless social media content creation, I contributed as a backend developer using NestJS and Prisma to build scalable APIs supporting dynamic post generation. My work also included cloud engineering tasks on Google Cloud, such as deploying multiple releases, optimizing Cloud SQL databases, and maintaining backend reliability. Reactable empowers businesses, educators, and marketers to generate professional-quality social media posts with ease, leveraging AI to adapt content styles to user needs and performance insights.",
        "url": "https://reactable.ai/"
      },
      {
        "company": "Junngla SPA",
        "title": "Full stack Developer",
        "years": "2023 - 2024",
        "description": "This project involved developing a payment processing system through QR codes. On the backend, it utilized Node.js, Express.js, and Nest.js frameworks for building scalable and efficient server-side applications. Relational (SQL) and NoSQL (MongoDB) databases were employed for robust data storage and retrieval. Docker was used for containerization and streamlined deployment processes. API documentation was handled with Swagger for better collaboration and maintenance. Additionally, the Adonis.js full-stack framework was employed for rapid development and reduced time-to-market. On the frontend, Vue.js was used to create dynamic and interactive web applications with seamless user experiences.",
        "url": "https://junngla.com/"
      },
      {
        "company": "Jumpitt Labs",
        "title": "Full stack Developer",
        "years": "2021-2023",
        "description": "This was a story-sharing application similar to Instagram Stories, but focused on businesses, allowing companies to share updates with their network. The backend was built using Node.js, Express.js, and Apache Kafka for efficient event streaming and message queueing. Producer and consumer microservices were implemented for a scalable and decoupled architecture. The frontend was developed with React.js, utilizing TSX and JSX syntax, functional components, props destructuring, and React Hooks for efficient state management. React Router DOM V6 was employed for seamless navigation and routing, while Material-UI components provided a consistent and visually appealing design. React forms were developed for capturing and validating user input.",
        "url": "https://www.jumpitt.com"
      },
      {
        "company": "Sistemas Expertos",
        "title": "Junior Bug Fixer",
        "years": "2020-2021",
        "description": "This project involved contributing to an Enterprise Resource Planning (ERP) software system for managing public health hospitals in Chile. On the backend, PHP was utilized for server-side development, with SQL statements (SQL queries) constructed and executed using the PostgreSQL database management system. JavaScript, Ajax, and jQuery were implemented for handling DOM events and enhancing user interactions on the frontend. The ERP system enabled features such as medication inventory management, patient scheduling, and examination room allocation.",
        "url": "https://www.sistemasexpertos.cl"
      },
      {
        "company": "SIRI Registry Information System ",
        "title": "Trainne Developer",
        "years": "2019",
        "description": "Web services administration, usage of server tools (GlassFish, Apache) - Database management, creation and usage of specific SQL Queries, also stored procedures. The project consisted in a software for electronic signature of legal documents, which was a web platform.",
        "url": "https://www.cbrchile.cl"
      }
    ],
    "skills": [
      {
        "name": "Javascript/Typescript",
        "level": "100%"
      },
      {
        "name": "Node.js",
        "level": "100%"
      },
      {
        "name": "Nest Js",
        "level": "100%"
      },
      {
        "name": "Express Js",
        "level": "100%"
      },
      {
        "name": "Scrum Development",
        "level": "100%"
      },
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "Vue js",
        "level": "80%"
      },
      {
        "name": "PHP",
        "level": "65%"
      }
    ]
  }
}